app/Controllers/ProductController.php

    public function insertProduct(){
        $data = [
            'nama_product' => $this->request->getPost('nama_product'),
            'description' => $this->request->getPost('description')
        ];

        $this->product->insertProductORM($data);
---
INSERT INTO `products` (`nama_product`, `description`) VALUES ('Buah', 'Semangka')

    public function readProduct(){
        $products = $this->product->findAll();
---
SELECT *
FROM `products`

    public function getProduct($id){
        $product = $this->product->where('id', $id)->first();
---
SELECT *
FROM `products`
WHERE `id` = '10'
 LIMIT 1

    public function updateProduct($id){
        $nama_product = $this->request->getVar('nama_product');
        $description = $this->request->getVar('description');
        $data = [
            'nama_product' => $nama_product,
            'description' => $description
        ];
        $this->product->update($id, $data);
---
UPDATE `products` SET `nama_product` = 'SANDY', `description` = 'PONOROGO'
WHERE `products`.`id` IN ('10')

    public function deleteProduct($id){
        $this->product->delete($id);
---
DELETE FROM `products`
WHERE `id` IN ('7')