app/Models/ProductModel.php

    public function insertProductORM($data){
        return $this->insert($data);
---
INSERT INTO `products` (`nama_product`, `description`) VALUES ('Product Name', 'Product Description')